Задание 1

Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:

среднюю букву, если число букв в слове четное;
две средних буквы, если число букв нечетное.

P.S. - не корректно прописано условие, вот верный вариант:
среднюю букву, если число букв в слове НЕчетное;
две средних буквы, если число букв ЧЕТНОЕ.

Решение:
word = input()
quantity = len(word)
print('кол-во символов: ', quantity)
sr = quantity // 2

if quantity % 2 != 0:
    print("Кол-во букв нечетно")
    print("Среднея буква:", word[sr])
else:
    print("Кол-во букв четно")
    sr_2 = sr - 1
    print("Две средние буквы:", word[sr_2]+word[sr])


Задание 2

Напишите программу, которая последовательно запрашивает у пользователя числа (по одному за раз) и после первого нуля выводит сумму всех ранее введенных чисел.


Решение: 
summa = 0
while True:
    zapros = int(input('Введите число:'))
    if zapros == 0: 
        break
    summa += zapros
print(summa)


Задание 3
Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек.
Выдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами после сортировки! Но мы не будем никого знакомить, если кто-то может остаться без пары:

boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']
girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']

quantity_b = len(boys)
quantity_g = len(girls)


if quantity_b == quantity_g:
    rez = zip(sorted(boys), sorted(girls))
    for i in rez:
        print(' и '.join(i))
else:
    print('Внимание, кто-то может остаться без пары!')


Задание 4
У нас есть список, содержащий информацию о среднедневной температуре в Фаренгейтах за произвольный период по странам (структура данных в примере). Необходимо написать код, который рассчитает среднюю температуру за период в Цельсиях(!) для каждой страны.

l1 = [
['Thailand', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],
['Germany', [57.2, 55.4, 59, 59, 53.6]],
['Russia', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],
['Poland', [50, 50, 53.6, 57.2, 55.4, 55.4]]
]

for elem in l1:
    country = elem[0]
    mean_temp = sum(elem[1])/len(elem[1])
    celsium = (mean_temp-32)/1.8
    print(country,' - ', round(celsium,1), 'C')